Revit 2027 API
View.SetNonControlledTemplateParameterIds Method
 Sets the parameters that will not be included when this view is used as a template.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetNonControlledTemplateParameterIds(
	ICollection<ElementId> newSet
)
Public Sub SetNonControlledTemplateParameterIds (
	newSet As ICollection(Of ElementId)
)
public:
void SetNonControlledTemplateParameterIds(
	ICollection<ElementId^>^ newSet
)
member SetNonControlledTemplateParameterIds :
        newSet : ICollection<ElementId> -> unit
Parameters
newSet ICollection<ElementId>
 The parameter ids that should not be marked to be included.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 This should be a subset of the parameters returned by GetTemplateParameterIds() (other parameters will be ignored).
See Also
Reference
View Class
Autodesk.Revit.DB Namespace